app/controllers/admin_controller.rb

  def index
  	@orders = Order.all
  	@total_orders = Order.where(:ship_date => nil).count
---
SELECT COUNT(*) FROM `orders` WHERE `orders`.`ship_date` IS NULL