app/controllers/carts_controller.rb

DELETE FROM `carts` WHERE `carts`.`id` = 10
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 10 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])