app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
    session[:counter] = 0

    respond_to do |format|
      if @line_item.save
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`, `price`) VALUES (1, 1, '2018-11-27 13:21:20', '2018-11-27 13:21:20', 45)

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 2 LIMIT 1