app/controllers/orders_controller.rb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`ship_date` IS NULL ORDER BY `orders`.`created_at` DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `orders` WHERE `orders`.`ship_date` IS NULL
---
  def index
    @orders = Order.where(:ship_date => nil).paginate(page: params[:page], per_page: 1).order(created_at: :desc)

INSERT INTO `orders` (`name`, `address`, `email`, `created_at`, `updated_at`, `pay_type_id`) VALUES ('janis', 'a', 'rr@example.com', '2018-11-27 13:21:34', '2018-11-27 13:21:34', 1)
DELETE FROM `carts` WHERE `carts`.`id` = 1
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `orders` SET `ship_date` = '2018-11-27', `updated_at` = '2018-11-27 14:45:44' WHERE `orders`.`id` = 1
---
  def update_ship_date
    @order = Order.find(params[:id])

    @order.ship_date = Time.now
    @order.save!

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
    def set_order
      @order = Order.find(params[:id])