app/controllers/sessions_controller.rb

  def create
    if User.count.zero?
      redirect_to new_user_path
    else
      user = User.find_by(name: params[:name])
---
SELECT COUNT(*) FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'user' LIMIT 1