app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('user', '$2a$10$iDIhjodFutoy7/MUogiek.KFxHU9Reqr2j1/hHZvMKK.rK14l2l/K', '2018-11-27 14:45:26', '2018-11-27 14:45:26')

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1